# 12. Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list_1 = list(map(float, input("Введите числа через пробел:\n").split()))
j = len(list_1)
i = 0

while i < (len(list_1)/2):
    com = list_1[i] * list_1[j-1]
    i += 1
    j -=1
    print(com, end=" ")